//! 1. Підрахуйте суму всіх чисел у заданому користувачем діапазоні. 

// let min = Number(prompt("введіть початок діапазону",""));
// let max = Number(prompt("введіть кінець діапазону",""));
// let sum = 0;
 
// while(min <= max){       
//        sum += min;  
//        min ++;
//     }
 
// alert(sum);




//! 2. Запросіть 2 числа і знайдіть тільки найбільший спільний дільник.


// ! 1 рішення
// let one = +prompt("введіть перше число");
// let two = +prompt("введіть друге число");

// let res = 1;
// let min = one < two ? one : two;
// let i = min;
// for ( let i = min ; i > 1; i--) {
//     if ( one % i === 0 && two % i === 0) {
//         res = i;
//     }
// }
// alert(res);


// ! 2 рішення
// let one = +prompt("введіть перше число");
// let two = +prompt("введіть друге число");

// let res = 1;
// let min = one < two ? one : two;
// let i = min;
// while (i > 1){
//     if (one % i === 0 && two % i === 0) {
   
//     res = i;
// }
//  i--;
// }

// alert(res);



//! 3. Запросіть у користувача число та виведіть усі дільники цього числа

// let res = "";
// let n = +prompt('введіть число');
// for ( let i = n - 1; i > 1; i--){
//     if ( n % i === 0) {
//         res += i + " ";
//     }
// }
// alert(res);




//! 4. Визначте кількість цифр у введеному числі

// ! фор

// let n = +prompt('введіть число');
// let res = 1;

// for(let i = 10; n / i >= 1; i *= 10) {
//     res ++;   
// }

// alert(res);


// ! вайл
// let n = +prompt('введіть число');
// let res = 0;
// let x = 1;
// do { 
//     x = x * 10;
//     res++;

// } while (n / x >= 1);
// alert(res);







//! 5. Запросіть у користувача 10 чисел і підрахуйте, скільки він
// ввів додатних чисел, від’ємних та нулів. При цьому підрахуйте також кількість парних і непарних чисел. Виведіть
// статистику на екран. Враховуйте те, що достатньо однієї
// змінної (не 10) для введення чисел користувачем.

// let numbers = prompt('введіть 10 чисел через пробіл');
// let numbersAr = numbers.split(" ");
// console.log(numbersAr);
// let par = 0;
// let nePar = 0;
// let zero = 0;
// let plus = 0;
// let minus = 0;
// for ( i = 1; i <= numbersAr.length; i ++) {
//     console.log(i);
//     if (i < 0 ) {
//          minus += 1;
//     } else if (i === 0){
//         zero += 1;
//     } else if (i > 0) {
//         plus += 1;
//     } else if (i % 2 === 0) {
//         par += 1;
//     } else if (i % 2 === 1) {
//         nePar += 1;
//     } else if (i < 0 ) {
//          minus += 1;
//     }
  
    
// }
// alert(`${minus},${plus},${par},${nePar},${zero}`);




//! 6. Зацикліть калькулятор. Запросіть у користувача 2 числа і знак, розв’яжіть приклад, виведіть результат і запитайте, чи хоче він розв’язати ще один приклад. І так триватиме доти, доки користувач не відмовиться.

// do {
//     let a = +prompt('введіть число');
//     let b = +prompt('введіть число');
//     let c = prompt('введіть дію + - * /');
//     switch (c) {
//         case "+":
//             alert(a + b);
//             break;
//         case "-":
//             alert(a - b);
//             break;
//         case "*":
//             alert(a * b);
//             break;
//         case "/":
//             alert(a / b);
//             break;
//     }

// } 
// while (confirm("хочете продовжити?"));


// ! 7-


//! 8. Зацикліть виведення днів тижня таким чином: «День тижня. Бажаєте побачити назву наступного дня тижня?”, і так доти, доки користувач натискатиме OK. 

// do {
//     let day = prompt("введіть день тижня");
   
//     switch (day) {
//         case "понеділок":
//             alert("вівторок");
//             break;
//         case "вівторок":
//             alert("середа");
//             break;
//         case "середа":
//             alert("четверг");
//             break;
//         case "четверг":
//             alert("пятниця");
//             break;
//         case "п’ятниця":
//             alert("субота");
//             break;
//         case "субота":
//             alert("неділя");
//             break;
//         case "неділя":
//             alert("понеділок");
//             break;
//     }

// } 
// while (confirm("Бажаєте побачити назву наступного дня тижня?"));



//! 9. Виведіть таблицю множення для всіх чисел від 2 до 9. Кожне число необхідно помножити на числа від 1 до 10.

// let col = "";
// for( let i = 2; i <= 9; i++) {
//    for ( let x = 1; x <= 10; x++){
//     col += `${i} * ${x} = ${i * x}\n`;
//    }
//      console.log(col);
//      col= "";
// }
// console.log(col);



//! 10. Гра «Вгадай число». Запропонуйте користувачеві загадати число від 0 до 100 і відгадати його наступним способом: в кожній ітерації циклу поділяєте діапазон чисел навпіл, записуєте результат в N і запитуєте у користувача «Ваше число > N, < N або == N?». Залежно від відповіді користувача, зменшуєте діапазон. Початковий діапазон від 0 до 100, поділяєте навпіл і отримуєте 50. Якщо користувач вказав, що його число > 50, змінюєте діапазон числа від 51 до 100. І так доти, доки користувач не вибере == N.

// let min = 0;
// let max = 100;
// let avg = 0;
// do {
//     avg = (min + max) / 2;
//     if (confirm(`число більше за ${Math.floor(avg)}`)) {
//         min = Math.floor(avg);
        
//     } else {
//         max = Math.floor(avg);
//     }
// } while (max - min > 1) ;
// alert(`ваше число ${Math.floor(avg)}`);







